emacs/init.org
#+TITLE: Emacs Configuration
#+AUTHOR: Jonathan Cui
#+PROPERTY: header-args:emacs-lisp :tangle init.el

* Startup Performance
Make startup faster by reducing the frequency of garbage collection and then use a hook to measure Emacs startup time.
#+begin_src emacs-lisp
  (setq gc-cons-threshold (* 50 1000 1000))

  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))
#+end_src

* Native Compilation
Show if native comp is available.
#+begin_src emacs-lisp
  (if (and (fboundp 'native-comp-available-p)
           (native-comp-available-p))
      (message "Native comp is available")
    (message "Native comp is *not* available"))
#+end_src

* User Information
#+begin_src emacs-lisp
  (setq-default user-full-name "Jonathan Cui"
                user-mail-address "joncui1101@gmail.com")
#+end_src

* Server Mode
Allow access from emacsclient
#+begin_src emacs-lisp
  (add-hook 'after-init-hook
            (lambda ()
              (require 'server)
              (unless (server-running-p)
                (server-start))))
#+end_src
* Package Management
Set up ELPA, MELPA, and Org package repositories and load =use-package= to manage package configuration.
#+begin_src emacs-lisp
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("gnu" . "https://elpa.gnu.org/packages/")))
  (unless package--initialized
    (package-initialize))

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (require 'use-package)

  (setq use-package-always-ensure t)
#+end_src

Install f package
#+begin_src emacs-lisp
  (unless (package-installed-p 'f)
    (package-refresh-contents)
    (package-install 'f))

  (require 'f)
#+end_src

* Custom File
Keep custom changes in its own file.
#+begin_src emacs-lisp
  (setq-default custom-file (f-expand "custom.el" user-emacs-directory))
  (load custom-file t)
#+end_src

* Custom Functions
#+begin_src emacs-lisp
  (defun jc/reload-emacs-config ()
    "Reload Emacs config."
    (interactive)
    (load-file user-init-file))

  (defun jc/server-shutdown ()
    "Save buffers, Quit, and Shutdown (kill) server."
    (interactive)
    (save-some-buffers)
    (kill-emacs))
#+end_src
* Update Load Path
** With Work Configs
#+begin_src emacs-lisp
  (if (f-exists-p "~/workspace/work/dotfiles/emacs/init-work.el")
      (progn
        (add-to-list 'load-path (f-expand "~/workspace/work/dotfiles/emacs"))
        (require 'init-work)))
#+end_src
* Keep Emacs Directory Clean
Move transient files into a separate directory (~/.config/cache/emacs)
#+begin_src emacs-lisp
  (defvar transient-directory "~/.config/cache/emacs/")

  (setq backup-directory-alist `(("." . ,(f-expand "backups" transient-directory)))
        url-configuration-directory (f-expand "url" transient-directory)
        auto-save-list-file-prefix (f-expand "auto-save-list/.saves-" transient-directory)
        package-quickstart-file (f-expand "package-quickstart.el" transient-directory))

  (setq-default backup-by-copying t ; Use copying to create backup files.
                create-lockfiles nil ; Disable lockfiles.
                delete-old-versions t ; Deletes excess backup files silently.
                load-prefer-newer t) ; Load newest version of a file.
#+end_src

* Load Environment Variables
Custom function to load environment variables from a file.
#+begin_src emacs-lisp
  (defun jc/load-env (file)
    "Load the contents of the FILE as 'exec-path'."
    (let ((file-path (f-expand file user-emacs-directory)))
      (if (f-exists? file-path)
          (let ((paths (s-trim (f-read-text file-path))))
            (setenv "PATH" paths)
            (dolist (path (s-split ":" paths))
              (add-to-list 'exec-path path))))))

  (jc/load-env "env-file")
#+end_src

* Key Bindings
** Which Key
#+begin_src emacs-lisp
  (use-package which-key
    :defer 1
    :diminish
    :init
    (which-key-mode)
    :custom
    (which-key-idle-delay 0.3))
#+end_src
** Evil Mode
#+begin_src emacs-lisp
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-respect-visual-line-mode t)
    :custom
    (evil-symbol-word-search t)
    :config
    (evil-mode 1))

  (use-package evil-surround
    :defer 1
    :config
    (global-evil-surround-mode 1))

  (use-package evil-snipe
    :defer 1
    :diminish evil-snipe-local-mode
    :requires evil
    :config
    (evil-snipe-mode 1)
    (evil-snipe-override-mode 1)
    :custom
    (evil-snipe-scope 'buffer)
    (evil-snipe-repeat-scope 'buffer)
    (evil-snipe-spillover-scope 'whole-buffer))

  (use-package evil-collection
    :defer 1
    :requires evil
    :config
    (evil-collection-init)
    :custom
    (evil-collection-setup-minibuffer t))
#+end_src
* General Configuration
** User Interface
Prevent frame from resizing implicitly. Maximize frames by default. Removes toolbar, scrollbar and menubar.
#+begin_src emacs-lisp
  (setq frame-inhibit-implied-resize t)
  (add-to-list 'initial-frame-alist '(fullscreen . maximized))

  ;; Remove tool bar
  (tool-bar-mode -1)

  ;; Remove scroll bar
  (scroll-bar-mode -1)

  ;; Remove menu bar
  (menu-bar-mode -1)

  ;; Turn on visual line mode
  (global-visual-line-mode t)

  ;; Turn off blinking cursor
  (blink-cursor-mode 0)

  ;; See matching pairs of parantheses and other characters
  (show-paren-mode 1)

  ;; Show column numbers
  (column-number-mode)

  (setq-default confirm-kill-emacs 'y-or-n-p ; y or n instead of yes or no when quitting.
                initial-scratch-message nil ; Start with a blank canvas.
                inhibit-startup-screen t) ; Do not show the startup screen.
#+end_src

** Theme
Set the theme using doom-themes. Currently using doom-vibrant.
#+begin_src emacs-lisp
  (use-package doom-themes
    :config
    (setq doom-themes-enable-bold t
          doom-themes-enable-italic t)
    (load-theme 'doom-vibrant t)
    (doom-themes-visual-bell-config))
#+end_src

** Mode Line
Setup the modeline using doom-modeline.
#+begin_src emacs-lisp
  (use-package doom-modeline
    :hook (after-init . doom-modeline-init)
    :custom-face
    (mode-line ((t (:height 120))))
    (mode-line-inactive ((t (:height 120))))
    :custom
    (doom-modeline-env-enable-python nil)
    (doom-modeline-lsp t)
    (doom-modeline-modal-icon nil)
    (doom-modeline-vcs-max-length 50))
#+end_src

Use delight to rename emacs-lisp-mode
#+begin_src emacs-lisp
  (use-package delight
    :delight
    (emacs-lisp-mode "elisp"))
#+end_src

** Fonts
Using Hasklug [[https://github.com/ryanoasis/nerd-fonts][Nerd Font]]
#+begin_src emacs-lisp
  (set-face-attribute 'default nil
                      :family "Hasklug Nerd Font"
                      :weight 'normal
                      :width 'normal
                      :height 130)
#+end_src

Enable Ligatures
#+begin_src emacs-lisp
  (use-package ligature
    :defer 1
    :load-path "lisp-local"
    :config
    (ligature-set-ligatures 't '("www"))
    (ligature-set-ligatures 'prog-mode '("www" "**" "***" "**/" "*>" "*/" "\\\\" "\\\\\\" "{-" "::"
                                         ":::" ":=" "!!" "!=" "!==" "-}" "----" "-->" "->" "->>"
                                         "-<" "-<<" "-~" "#{" "#[" "##" "###" "####" "#(" "#?" "#_"
                                         "#_(" ".-" ".=" ".." "..<" "..." "?=" "??" ";;" "/*" "/**"
                                         "/=" "/==" "/>" "//" "///" "&&" "||" "||=" "|=" "|>" "^=" "$>"
                                         "++" "+++" "+>" "=:=" "==" "===" "==>" "=>" "=>>" "<="
                                         "=<<" "=/=" ">-" ">=" ">=>" ">>" ">>-" ">>=" ">>>" "<*"
                                         "<*>" "<|" "<|>" "<$" "<$>" "<!--" "<-" "<--" "<->" "<+"
                                         "<+>" "<=" "<==" "<=>" "<=<" "<>" "<<" "<<-" "<<=" "<<<"
                                         "<~" "<~~" "</" "</>" "~@" "~-" "~>" "~~" "~~>" "%%"))
    (global-ligature-mode t))
#+end_src

* Editing Configuration
Default tab width to 2 spaces.
#+begin_src emacs-lisp
  (setq-default tab-width 2
                evil-shift-width tab-width)
#+end_src

Use spaces instead of tabs for indentation.
#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
#+end_src

Backspace erases a tab instead of 1 space at a time.
#+begin_src emacs-lisp
  (setq-default backward-delete-char-untabify-method 'hungry)
#+end_src

Single space to end a sentence.
#+begin_src emacs-lisp
  (setq-default sentence-end-double-space nil)
#+end_src
* Org Mode
** Org Configuration
Set up Org Mode with a baseline configuration.
#+begin_src  emacs-lisp
  (defun jc/org-mode-setup ()
    (org-indent-mode)
    ;; (variable-pitch-mode 1)
    (auto-fill-mode 0)
    (setq evil-auto-indent nil))

  (use-package org
    :defer t
    :hook (org-mode . jc/org-mode-setup)
    :bind (:map org-mode-map
                ("C-<tab>" . org-indent-block))
    :init
    (setq org-directory "~/workspace/personal/notes"
          org-default-notes-file (f-expand "Inbox")))
#+end_src

