emacs/init.el
(if (and (fboundp 'native-comp-available-p)
         (native-comp-available-p))
    (message "Native comp is available")
  (message "Native comp is *not* available"))

(setq-default user-full-name "Jonathan Cui"
              user-mail-address "joncui1101@gmail.com")

(add-hook 'after-init-hook
          (lambda ()
            (require 'server)
            (unless (server-running-p)
              (server-start))))

(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("gnu" . "https://elpa.gnu.org/packages/")))
(unless package--initialized
  (package-initialize))

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'use-package)

(setq use-package-always-ensure t)

(unless (package-installed-p 'f)
  (package-refresh-contents)
  (package-install 'f))

(require 'f)

(setq-default custom-file (f-expand "custom.el" user-emacs-directory))
(load custom-file t)

(defun jc/reload-emacs-config ()
  "Reload Emacs config."
  (interactive)
  (load-file user-init-file))

(defun jc/server-shutdown ()
  "Save buffers, Quit, and Shutdown (kill) server."
  (interactive)
  (save-some-buffers)
  (kill-emacs))

(if (f-exists-p "~/workspace/work/dotfiles/emacs/init-work.el")
    (progn
      (add-to-list 'load-path (f-expand "~/workspace/work/dotfiles/emacs"))
      (require 'init-work)))

(defvar transient-directory "~/.config/cache/emacs/")

(setq backup-directory-alist `(("." . ,(f-expand "backups" transient-directory)))
      url-configuration-directory (f-expand "url" transient-directory)
      auto-save-list-file-prefix (f-expand "auto-save-list/.saves-" transient-directory)
      package-quickstart-file (f-expand "package-quickstart.el" transient-directory))

(setq-default backup-by-copying t ; Use copying to create backup files.
              create-lockfiles nil ; Disable lockfiles.
              delete-old-versions t ; Deletes excess backup files silently.
              load-prefer-newer t) ; Load newest version of a file.

(defun jc/load-env (file)
  "Load the contents of the FILE as 'exec-path'."
  (let ((file-path (f-expand file user-emacs-directory)))
    (if (f-exists? file-path)
        (let ((paths (s-trim (f-read-text file-path))))
          (setenv "PATH" paths)
          (dolist (path (s-split ":" paths))
            (add-to-list 'exec-path path))))))

(jc/load-env "env-file")

(use-package which-key
  :defer 1
  :diminish
  :init
  (which-key-mode)
  :custom
  (which-key-idle-delay 0.3))

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-respect-visual-line-mode t)
  :custom
  (evil-symbol-word-search t)
  :config
  (evil-mode 1))

(use-package evil-surround
  :defer 1
  :config
  (global-evil-surround-mode 1))

(use-package evil-snipe
  :defer 1
  :diminish evil-snipe-local-mode
  :requires evil
  :config
  (evil-snipe-mode 1)
  (evil-snipe-override-mode 1)
  :custom
  (evil-snipe-scope 'buffer)
  (evil-snipe-repeat-scope 'buffer)
  (evil-snipe-spillover-scope 'whole-buffer))

(use-package evil-collection
  :defer 1
  :requires evil
  :config
  (evil-collection-init)
  :custom
  (evil-collection-setup-minibuffer t))

;; Turn on visual line mode
(global-visual-line-mode t)

;; Turn off blinking cursor
(blink-cursor-mode 0)

;; See matching pairs of parantheses and other characters
(show-paren-mode 1)

;; Show column numbers
(column-number-mode)

(setq-default confirm-kill-emacs 'y-or-n-p ; y or n instead of yes or no when quitting.
              split-height-threshold 90 ; Increase height threshold from 80 to 90 so split screens will favor horizontal splits
              initial-scratch-message nil ; Start with a blank canvas.
              inhibit-startup-screen t) ; Do not show the startup screen.

(use-package doom-themes
  :config
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t)
  (load-theme 'doom-vibrant t)
  (doom-themes-visual-bell-config))

(use-package doom-modeline
  :hook (after-init . doom-modeline-init)
  :custom-face
  (mode-line ((t (:height 120))))
  (mode-line-inactive ((t (:height 120))))
  :custom
  (doom-modeline-env-enable-python nil)
  (doom-modeline-lsp t)
  (doom-modeline-modal-icon nil)
  (doom-modeline-vcs-max-length 50))

(use-package delight
  :delight
  (emacs-lisp-mode "elisp"))

(set-face-attribute 'default nil
                    :family "Hasklug Nerd Font"
                    :weight 'normal
                    :width 'normal
                    :height 130)

(use-package ligature
  :defer 1
  :load-path "lisp-local"
  :config
  (ligature-set-ligatures 't '("www"))
  (ligature-set-ligatures 'prog-mode '("www" "**" "***" "**/" "*>" "*/" "\\\\" "\\\\\\" "{-" "::"
                                       ":::" ":=" "!!" "!=" "!==" "-}" "----" "-->" "->" "->>"
                                       "-<" "-<<" "-~" "#{" "#[" "##" "###" "####" "#(" "#?" "#_"
                                       "#_(" ".-" ".=" ".." "..<" "..." "?=" "??" ";;" "/*" "/**"
                                       "/=" "/==" "/>" "//" "///" "&&" "||" "||=" "|=" "|>" "^=" "$>"
                                       "++" "+++" "+>" "=:=" "==" "===" "==>" "=>" "=>>" "<="
                                       "=<<" "=/=" ">-" ">=" ">=>" ">>" ">>-" ">>=" ">>>" "<*"
                                       "<*>" "<|" "<|>" "<$" "<$>" "<!--" "<-" "<--" "<->" "<+"
                                       "<+>" "<=" "<==" "<=>" "<=<" "<>" "<<" "<<-" "<<=" "<<<"
                                       "<~" "<~~" "</" "</>" "~@" "~-" "~>" "~~" "~~>" "%%"))
  (global-ligature-mode t))

(setq-default tab-width 2
              evil-shift-width tab-width)

(setq-default indent-tabs-mode nil)

(setq-default backward-delete-char-untabify-method 'hungry)

(setq-default sentence-end-double-space nil)

(defun jc/org-mode-setup ()
  (org-indent-mode)
  ;; (variable-pitch-mode 1)
  (auto-fill-mode 0)
  (setq evil-auto-indent nil))

(use-package org
  :defer t
  :hook (org-mode . jc/org-mode-setup)
  :bind (:map org-mode-map
              ("C-<tab>" . org-indent-block))
  :init
  (setq org-directory "~/workspace/personal/notes"
        org-default-notes-file (f-expand "Inbox")))
