emacs/init.el

(use-package evil-org
  :after org
  :hook ((org-mode . evil-org-mode)
         (org-agenda-mode . evil-org-mode)
         (evil-org-mode . (lambda () (evil-org-set-key-theme '(navigation todo insert textobjects additional)))))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(defvar jc/init-org-file (f-expand "~/workspace/personal/dotfiles/emacs/init.org"))

(defun jc/tangle-on-save ()
  (when (equal (buffer-file-name)
               (expand-file-name jc/init-org-file))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle)
      (message "early-init.el and init.el tangled from init.org"))))

(add-hook 'after-save-hook 'jc/tangle-on-save)

(use-package ivy
  :defer 1
  :bind (:map ivy-minibuffer-map
              ("C-l" . ivy-alt-done)
              ("C-j" . ivy-next-line)
              ("C-k" . ivy-previous-line)
              :map ivy-switch-buffer-map
              ("C-d" . ivy-switch-buffer-kill)
              ("C-k" . ivy-previous-line)
              :map ivy-reverse-i-search-map
              ("C-k" . ivy-previous-line)
              ("C-d" . ivy-reverse-i-search-kill))
  :init
  (ivy-mode +1)
  :custom
  (enable-recursive-minibuffers t)
  (ivy-count-format "(%d/%d) ")
  (ivy-re-builders-alist '((t . ivy--regex-ignore-order)))
  (ivy-use-virtual-buffers t)
  (ivy-wrap t))

(use-package counsel
  :requires ivy
  :init
  (counsel-mode +1)
  :bind (("C-x b" . counsel-ibuffer)
         ("M-c" . quick-calc)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :custom
  (ivy-initial-inputs-alist nil))

(use-package ivy-rich
  :requires ivy
  :config
  (plist-put ivy-rich-display-transformers-list
             'counsel-M-x
             '(:columns
               ((counsel-M-x-transformer (:width 50))
                (ivy-rich-counsel-function-docstring (:face font-lock-doc-face)))))
  (plist-put ivy-rich-display-transformers-list
             'ivy-switch-buffer
             '(:columns
               ((ivy-switch-buffer-transformer (:width 50))
                (ivy-rich-switch-buffer-indicators (:width 4 :face error :align right))
                (ivy-rich-switch-buffer-major-mode (:width 12 :face warning))
                (ivy-rich-switch-buffer-project (:width 0.18 :face success))
                (ivy-rich-switch-buffer-path (:width (lambda (x) (ivy-rich-switch-buffer-shorten-path x (ivy-rich-minibuffer-width 0.3))))))))
  (ivy-rich-mode +1)
  (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line))

(use-package ivy-posframe
  :init
  (setq ivy-posframe-display-functions-alist
        '((counsel-projectile-switch-project . ivy-posframe-display-at-frame-center)
          (counsel-projectile-find-file . ivy-posframe-display-at-frame-center)
          (counsel-M-x . ivy-posframe-display-at-frame-center)
          (counsel-projectile . ivy-posframe-display-at-frame-center)
          (counsel-projectile-switch-to-buffer . ivy-posframe-display-at-frame-center))
        ivy-posframe-min-width 115
        ivy-posframe-parameters '((left-fringe . 4)
                                  (right-fringe . 4)))
  (ivy-posframe-mode 1))

(use-package lsp-ivy
  :requires (lsp-mode ivy))

(use-package company
  :defer 1
  :config (global-company-mode 1)
  :custom
  (company-idle-delay 0)
  (company-minimum-prefix-length 1))

(use-package savehist
  :ensure nil
  :custom
  (savehist-file "~/.config/cache/emacs/savehist")
  (history-length 1000)
  (history-delete-duplicates t)
  (savehist-save-minibuffer-history t)
  :hook (after-init . savehist-mode))

(use-package yasnippet
  :hook ((prog-mode text-mode org-mode) . yas-minor-mode)
  :bind (:map yas-minor-mode-map
              ("C-l" . yas-expand))
  :config
  (yas-reload-all))

(unless (package-installed-p 'yasnippet-snippets)
  (package-refresh-contents)
  (package-install 'yasnippet-snippets))

(defun jc/line-numbers ()
  (display-line-numbers-mode 1)
  (setq display-line-numbers 'relative))

(use-package display-line-numbers
  :hook (((prog-mode text-mode) . jc/line-numbers)))

(use-package smartparens
  :diminish
  :config
  (require 'smartparens-config)
  :hook ((org-mode prog-mode) . smartparens-mode))

(use-package hl-line
  :ensure nil
  :hook ((prog-mode text-mode dired-mode) . hl-line-mode))

(use-package highlight-indent-guides
  :custom
  (highlight-indent-guides-method 'bitmap)
  :hook (((prog-mode) . highlight-indent-guides-mode)))

(if (executable-find "asdf")
    (setenv "ASDF_DATA_DIR" (f-expand "~/.config/asdf")))

(use-package flycheck
  :defer t
  :preface
  :hook ((ledger-mode emacs-lisp-mode lsp-mode) . flycheck-mode)
  :custom
  (flycheck-flake8-maximum-line-length 120)
  (flycheck-flake8-maximum-complexity 40))

(use-package flycheck-ledger
  :requires flycheck)

(use-package tree-sitter
  :hook (((go-mode python-mode ruby-mode) . tree-sitter-mode)
         (tree-sitter-after-on . tree-sitter-hl-mode)))

(use-package tree-sitter-langs
  :after tree-sitter)

(use-package magit
  :defer 1
  :config
  (setq magit-branch-read-upstream-first 'fallback)
  (if (boundp 'jc/magit-repository-directories)
      (setq magit-repository-directories jc/magit-repository-directories)
    (setq magit-repository-directories '(("~/workspace" . 2)))))

(use-package git-gutter
  :defer 1
  :diminish
  :config (global-git-gutter-mode +1)
  :custom
  (git-gutter:update-interval 2))

(use-package projectile
  :defer 1
  :diminish
  :init
  (projectile-mode 1)
  :bind (:map projectile-mode-map
              ("C-c p" . projectile-command-map))
  :config
  (add-to-list 'projectile-globally-ignored-directories "vendor")
  (add-to-list 'projectile-globally-ignored-directories ".github")
  :custom
  (projectile-enable-caching t)
  (projectile-require-project-root t)
  (projectile-indexing-method 'native)
  (projectile-project-root-functions '(projectile-root-local projectile-root-bottom-up projectile-root-top-down-recurring))
  (projectile-completion-system 'ivy)
  (projectile-known-projects-file (f-expand "projectile-bookmarks.eld" transient-directory))
  (projectile-cache-file (f-expand "projectile.cache" transient-directory))
  :config
  (if (boundp 'jc/projectile-project-search-path)
      (setq projectile-project-search-path projectile-project-search-path)
    (setq projectile-project-search-path '("~/workspace/personal"))))

(defun jc/search-specific-glob (glob)
  "Search in the project files given the GLOB (specific file type)."
  (interactive "sGlob?: ")
  (counsel-projectile-rg (s-concat "--glob " glob)))

(use-package counsel-projectile
  :requires (counsel projectile)
  :init
  (counsel-projectile-mode 1)
  :bind (("C-c p s f" . jc/search-specific-glob))
  :custom
  (counsel-projectile-find-file-matcher 'ivy--re-filter))
