emacs/init.org
*** Language Server
#+begin_src emacs-lisp
  (use-package lsp-mode
    :hook (((go-mode yaml-mode dockerfile-mode sh-mode python-mode ruby-mode) . lsp-deferred)
           (lsp-mode . lsp-enable-which-key-integration))
    :custom
    (lsp-diagnostics-provider :none)
    (lsp-enable-file-watchers nil)
    (lsp-headerline-breadcrumb-enable t)
    (lsp-headerline-breadcrumb-enable-diagnostics nil)
    (lsp-keymap-prefix "C-l")
    (lsp-lens-enable nil)
    (lsp-modeline-diagnostics-enable nil)
    (lsp-session-file (f-expand "lsp-session-v1" transient-directory))
    :commands (lsp lsp-deferred))

  (use-package lsp-ui
    :commands lsp-ui-mode
    :config
    (setq lsp-ui-sideline-show-code-actions t
          lsp-ui-sideline-show-diagnostics t))
#+end_src
*** Golang
#+begin_src emacs-lisp
  (defun jc/lsp-go-install-save-hooks ()
    (add-hook 'before-save-hook #'lsp-format-buffer t t)
    (add-hook 'before-save-hook #'lsp-organize-imports t t))
  (use-package go-mode
    :mode "\\.go\\'"
    :hook
    (go-mode . jc/lsp-go-install-save-hooks)
    :custom
    (gofmt-command "goimports"))
#+end_src
*** Python
Currently using pyenv to set python version.
#+begin_src emacs-lisp
  (defun jc/projectile-pyenv-mode-set ()
    "Set pyenv version matching project name."
    (let ((pyenv-version-path (f-expand ".python-version" (projectile-project-root))))
      (if (f-exists? pyenv-version-path)
          (progn
            (pyenv-mode-set (car (s-lines (s-trim (f-read-text pyenv-version-path)))))
            (setq flycheck-python-flake8-executable (s-concat (pyenv-mode-full-path (pyenv-mode-version)) "/bin/python3")))
        (pyenv-mode-unset))))

  (use-package python-mode
    :delight '(:eval (format " py[%s]" (pyenv-mode-version)))
    :hook (python-mode . (lambda () (modify-syntax-entry ?_ "w" python-mode-syntax-table))))

  (use-package pyenv-mode
    :custom
    (pyenv-mode-mode-line-format nil)
    :hook
    (python-mode . pyenv-mode)
    (projectile-after-switch-project . jc/projectile-pyenv-mode-set))
#+end_src
*** Ruby
#+begin_src emacs-lisp
  (use-package ruby-mode
    :hook (ruby-mode . (lambda () (modify-syntax-entry ?_ "w" ruby-mode-syntax-table))))
#+end_src
*** Javascript
#+begin_src emacs-lisp
  (use-package js2-mode
    :mode "\\.js\\'")
#+end_src
*** Emacs Lisp
#+begin_src emacs-lisp
  (use-package emacs-lisp
    :ensure nil
    :hook (emacs-lisp-mode . electric-indent-mode))
#+end_src
*** Shell
#+begin_src emacs-lisp
  (use-package sh-script
    :mode (("\\.sh\\'" . sh-mode)
           ("\\^.z.*\\'" . sh-mode)
           ("\\^zsh.*\\'" . sh-mode)
           ("\\zprofile\\'" . sh-mode)))
#+end_src
*** Markdown
#+begin_src emacs-lisp
  (use-package markdown-mode
    :mode (("\\.md\\'" . gfm-mode))
    :custom
    (markdown-command "pandoc"))
#+end_src
*** YAML
#+begin_src emacs-lisp
  (use-package yaml-mode
    :mode "\\.ya?ml\\'"
    :bind (:map yaml-mode-map
                ("\C-m" . newline-and-indent)))
#+end_src
*** Docker
#+begin_src emacs-lisp
  (use-package dockerfile-mode
    :mode "Dockerfile\\(?:\\.?.*\\)?\\'")
#+end_src
*** Protobuf
#+begin_src emacs-lisp
  (use-package protobuf-mode
    :preface
    (defconst protobuf-style-work
      '((c-basic-offset . 4)
        (indent-tabs-mode . nil)))
    :hook (protobuf-mode . (lambda () (c-add-style "work protobuf style" protobuf-style-work t)))
    :mode "\\.proto\\'")
#+end_src
* File Browsing
** Treemacs
#+begin_src emacs-lisp
  (use-package treemacs
    :defer t
    :custom
    (treemacs-persist-file (f-expand "treemacs-persist" transient-directory))
    :bind (:map global-map
                ("C-x t t" . treemacs)))

  (use-package treemacs-evil
    :after (treemacs evil))

  (use-package treemacs-projectile
    :after (treemacs projectile))

  (use-package treemacs-icons-dired
    :after (treemacs dired)
    :config (treemacs-icons-dired-mode))

  (use-package treemacs-magit
    :after (treemacs magit))
#+end_src
** Dired
#+begin_src emacs-lisp
  (setq-default dired-use-ls-dired nil)

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :hook (dired-load . dired-collapse-mode)
    :bind (("C-x C-j" . dired-jump)
           :map dired-mode-map
           ([remap dired-find-file] . dired-single-buffer)
           ([remap dired-mouse-find-file-other-window] . dired-single-buffer-mouse)
           ([remap dired-up-directory] . dired-single-up-directory)))

  (use-package dired-single)

  (use-package dired-collapse)
#+end_src

** Open Links
Functions and settings to open certain links with applications.
#+begin_src emacs-lisp
  (defun jc/browse-url-firefox (url &optional _new-window)
    "Open URL in firefox."
    (interactive (browse-url-interactive-arg "URL: "))
    (pcase system-type
      ('darwin (start-process (s-concat "open " url) nil "open" "-a" "firefox" url))
      ('windows-nt (message "Windows not available"))
      ('gnu/linux (start-process (s-concat "firefox " url) nil "firefox" url))))

  (defun jc/browse-url-vlc (url &optional _new-window)
    "Open URL in vlc."
    (interactive (browse-url-interactive-arg "URL: "))
    (pcase system-type
      ('darwin (start-process (s-concat "open " url) nil "open" "-a" "vlc" url "--args" "--video-on-top"))
      ('windows-nt (message "Windows not available"))
      ('gnu/linux (start-process (s-concat "vlc " url) nil "vlc" url "--video-on-top"))))

  (setq-default browse-url-handlers '(("www.youtube.com" . jc/browse-url-vlc)
                                      ("." . jc/browse-url-firefox)))
#+end_src
* Applications
** Finance
#+begin_src emacs-lisp
  (defun jc/ledger-save-buffer ()
    "Automatically clean the ledger buffer at each save."
    (interactive)
    (ledger-mode-clean-buffer)
    (save-buffer))

  (defun jc/ledger-evil-write ()
    "Automatically clean the ledger buffer at each save."
    (interactive)
    (ledger-mode-clean-buffer)
    (evil-write nil nil))

  (use-package ledger-mode
    :mode "\\.journal\\'"
    :bind ((:map ledger-mode-map
                 ("C-x C-s" . jc/ledger-save-buffer))
           ([remap evil-write] . jc/ledger-evil-write))
    :custom
    (ledger-binary-path "hledger")
    (ledger-mode-should-check-version nil)
    (ledger-init-file-name "")
    (ledger-default-date-format "%m/%d")
    (ledger-post-amount-alignment-at :decimal)
    (ledger-highlight-xact-under-point nil))

  (use-package evil-ledger
    :requires (evil ledger-mode)
    :hook (ledger-mode . evil-ledger-mode)
    :custom
    (evil-ledger-sort-key "S"))

  (use-package company-ledger
    :requires company
    :init
    (add-to-list 'company-backends 'company-ledger))
#+end_src
